makerspet/makerspet_fido/firmware/fido-esp32/fido-esp32.h
#ifndef FIDO_ESP32
#define FIDO_ESP32

// Motors config
#define WHEEL_DIA (2*33.5e-3) // meters
#define WHEEL_BASE (214.322*1e-3) // wheel base, meters
#define MAX_WHEEL_ACCEL 2.0   // wheel vs floor m2/sec

// ESP32 pin assignment
#define LED_PIN 2
#define YD_MOTOR_SCTP_PIN 15 // 2 PWM pin for control the speed of YDLIDAR's motor. 
#define YD_MOTOR_EN_PIN   12 // 15 The ENABLE PIN for YDLIDAR's motor                  
#define YD_MOTOR_SPEED 255  // LEAVE DISCONNECTED
#define YD_MOTOR_SPEED_DEFAULT -1  // disconnect SCTP pin for default motor speed
#define YD_MOTOR_SCTP_PWM_CHANNEL 0  // ESP32 PWM channel

// Micro-ROS config
#define UROS_CLIENT_KEY 0xCA1AA100
#define UROS_TELEM_TOPIC_NAME "telemetry"
#define UROS_LOG_TOPIC_NAME "rosout"
#define UROS_CMD_VEL_TOPIC_NAME "cmd_vel"
#define UROS_NODE_NAME "fido_esp32"
#define UROS_PING_PUB_PERIOD_MS 10000
#define UROS_TELEM_PUB_PERIOD_MS 50
#define UROS_TIME_SYNC_TIMEOUT_MS 1000

#define JOINTS_LEN (MOTOR_COUNT)
#define LDS_BUF_LEN 400
#define LDS_SERIAL_BAUD 128000  // YDLIDAR X4

// WiFi config
#define WIFI_CONN_TIMEOUT_SEC 30
#define RESET_SETTINGS_HOLD_SEC 5 // Hold button this long to reset WiFi

// ESP32 blinks when firmware init fails
#define ERR_WIFI_CONN 1
#define ERR_LDS_INIT 2
#define ERR_UROS_AGENT_CONN 3
#define ERR_WIFI_LOST 4
#define ERR_UROS_INIT 5
#define ERR_UROS_NODE 6
#define ERR_UROS_PUBSUB 7
#define ERR_UROS_EXEC 8
#define ERR_UROS_TIME_SYNC 9
#define ERR_UROS_SPIN 10

#define ERR_REBOOT_BLINK_CYCLES 3 // Blinki out an error a few times, then reboot
#define LONG_BLINK_MS 1000
#define LONG_BLINK_PAUSE_MS 2000
#define SHORT_BLINK_MS 200
#define SHORT_BLINK_PAUSE_MS 500

#define TELEM_PUB_PERIOD_MS 50
#define SPIN_TELEM_STATS 100 // Undefine for debug
#define PING_PUB_PERIOD_MS 10000

#if !defined(ESP32)
  #error This code builds on ESP32 Dev module only
#endif

void serial_callback(char c);
void scan_callback(uint8_t quality, float angle_deg,
  float distance_mm, bool startBit);

#endif  // FIDO_ESP32
